vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F490x1_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2"
  xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Holtek</vendor>
  <url>https://mcu.holtek.com.tw/pack</url>
  <name>HT32F490x1_DFP</name>
  <description>Holtek HT32F490x1 Series Device Support,Drivers</description>
  <releases>
    <release version="1.0.1" date="2025-02-26">
      1. Update Flash Loader
      2. Update F/W Library
    </release>

    <release version="1.0.0" date="2024-08-08">
      First Release version of HT32F490x1 Device Family Pack.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>Holtek</keyword>
    <keyword>HT32F490x1</keyword>
    <keyword>HT32F490</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M4  ********************** -->
    <family Dfamily="HT32F490xx Series" Dvendor="Holtek:106">
      <!--book name="Device/ARM/Documents/??_dgug.pdf" title="?? Device Generic Users Guide"/-->
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="0" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
      <compile header="Device/Include/ht32f490x1.h"/>

      <description>
HT32F490 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
HT32F490 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>

      <!-- ************************  Subfamily 'HT32F49041/49031'  **************************** -->
      <subFamily DsubFamily="HT32F49031/49041">
        <debug svd="SVD/HT32F490x1.svd"/>
        <description>
HT32F490x1 - ARM Cortex-M4 Core
  Frequency up to 96 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 16KB up to 64KB
  SRAM size up to 20KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode

Advanced analog peripherals
  Up to 1 x 12bit ADC

Integrated peripherals interface
  Up to 4 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI
  Up to 2 x I2C

On-chip resources
  Up to 1 x 16 bit Advanced Timer, 1 x SysTick Timer, 6 x 16 bit GPTM, 1 x 32 bit GPTM, 2 x WDT, 1 x ERTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
        </description>

        <feature type="WDT" n="2"/>
        <feature type="RTC" n="32768"/>
        <feature type="ADC" n="1" m="12"/>
        <feature type="Temp" n="-40" m="105"/>
        <feature type="VCC" n="2.40" m="3.60"/>

        <!-- *************************  Device 'HT32F49041_20TSSOP'  ***************************** -->
        <device Dname="HT32F49041_20TSSOP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49041_20TSSOP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_64.FLM" start="0x08000000" size="0x10000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49031_20TSSOP'  ***************************** -->
        <!-- <device Dname="HT32F49031_20TSSOP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49031_20TSSOP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x8000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_32.FLM" start="0x08000000" size="0x8000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

        <!-- *************************  Device 'HT32F49041_32QFN'  ***************************** -->
        <device Dname="HT32F49041_32QFN">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49041_32QFN"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_64.FLM" start="0x08000000" size="0x10000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49031_32QFN'  ***************************** -->
        <!-- <device Dname="HT32F49031_32QFN">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49031_32QFN"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x8000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_32.FLM" start="0x08000000" size="0x8000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

