vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F490x1_DFP.pdsc
        <!-- *************************  Device 'HT32F49041_32LQFP'  ***************************** -->
        <!-- <device Dname="HT32F49041_32LQFP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49041_32LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_64.FLM" start="0x08000000" size="0x10000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

        <!-- *************************  Device 'HT32F49031_32LQFP'  ***************************** -->
        <!-- <device Dname="HT32F49031_32LQFP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49031_32LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x8000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_32.FLM" start="0x08000000" size="0x8000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

        <!-- *************************  Device 'HT32F49041_48QFN'  ***************************** -->
        <!-- <device Dname="HT32F49041_48QFN">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49041_48QFN"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_64.FLM" start="0x08000000" size="0x10000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

        <!-- *************************  Device 'HT32F49031_48QFN'  ***************************** -->
        <!-- <device Dname="HT32F49031_48QFN">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49031_48QFN"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x8000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_32.FLM" start="0x08000000" size="0x8000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

        <!-- *************************  Device 'HT32F49041_48LQFP'  ***************************** -->
        <device Dname="HT32F49041_48LQFP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49041_48LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_64.FLM" start="0x08000000" size="0x10000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49031_48LQFP'  ***************************** -->
        <!-- <device Dname="HT32F49031_48LQFP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49031_48LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x8000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_32.FLM" start="0x08000000" size="0x8000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

        <!-- *************************  Device 'HT32F49041_64LQFP'  ***************************** -->
        <device Dname="HT32F49041_64LQFP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49041_64LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_64.FLM" start="0x08000000" size="0x10000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49031_64LQFP'  ***************************** -->
        <!-- <device Dname="HT32F49031_64LQFP">
          <compile header="Device/Include/ht32f490x1.h" define="USE_HT32F49031_64LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x8000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0x5000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F490x1_32.FLM" start="0x08000000" size="0x8000" default="1"/>
          <algorithm name="Flash/HT32F490x1_BOOTMEM_AP.FLM" start="0x1FFFE400" size="0x01000" default="0"/>
          <algorithm name="Flash/HT32F490x1_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        </device> -->

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="HT32F490x1">
      <description>Holtek HT32F490x1 Devices</description>
      <require Dvendor="Holtek:106" Dname="HT32F490*1*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Series id Conditions -->
    <condition id="HT32F490x1 ARMCC">
      <description>Holtek HT32F490x1 Series devices</description>
      <require Dvendor="Holtek:106" Dname="HT32F490*1*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="HT32F490x1 CMSIS">
      <description>Holtek HT32F490x1 Devices and CMSIS-CORE</description>
      <require condition="HT32F490x1"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="ht32f490x1_conf"/>
      <require Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="crm"/>
    </condition>

    <!-- HT32F490x1 STDPERIPHERALS CRM Conditions -->
    <condition id="HT32F490x1 STDPERIPHERALS CRM">
      <description>Holtek HT32F490x1 Standard Peripherals Drivers with CRM</description>
      <require condition="HT32F490x1 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="crm"/>
    </condition>

    <!-- HT32F490x1 STDPERIPHERALS MISC Conditions -->
    <condition id="HT32F490x1 STDPERIPHERALS MISC">
      <description>Holtek  HT32F490x1 Standard Peripherals Drivers with MISC</description>
      <require condition="HT32F490x1 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="misc"/>
    </condition>

