vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F490x1_DFP.pdsc
    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="flash" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
      </RTE_Components_h>
      <files>
        <!-- FLASH file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_flash.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_flash.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="gpio" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
      </RTE_Components_h>
      <files>
        <!-- GPIO file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_gpio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_gpio.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="i2c" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Inter-integrated Circuit (I2C) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
      </RTE_Components_h>
      <files>
        <!-- I2C file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_i2c.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_i2c.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="misc" Cversion="1.0.0" condition="HT32F490x1 CMSIS">
      <description>MISC driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
      </RTE_Components_h>
      <files>
        <!-- MISC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_misc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_misc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="pwc" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
      </RTE_Components_h>
      <files>
        <!-- PWC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_pwc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_pwc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="scfg" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>System config (SCFG) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SCFG
      </RTE_Components_h>
      <files>
        <!-- SPI file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_scfg.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_scfg.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="spi" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
      </RTE_Components_h>
      <files>
        <!-- SPI file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_spi.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_spi.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="tmr" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>TIMER driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
      </RTE_Components_h>
      <files>
        <!-- TIMER file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_tmr.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_tmr.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="usart" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
      </RTE_Components_h>
      <files>
        <!-- USART file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_usart.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_usart.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="usb" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
      </RTE_Components_h>
      <files>
        <!-- USART file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_usb.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_usb.c" attr="config" version="1.0.0" />
      </files>
    </component>

