vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F490x1_DFP.pdsc
    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="wdt" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>watchdog timer(WDT) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
      </RTE_Components_h>
      <files>
        <!-- WDT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_wdt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_wdt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f490x1_firmware_library" Csub="wwdt" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for HT32F490x1 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
      </RTE_Components_h>
      <files>
        <!-- WWDT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f490x1_wwdt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f490x1_wwdt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <!-- Utilities HT32F490x1 -->
    <component Cclass="Device" Cgroup="evb" Csub="ht32f49041_sk" Cversion="1.0.0" condition="HT32F490x1 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/ht32f490x1_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/ht32f490x1_board.c" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Config HT32F490x1 -->
    <component Cclass="Device" Cgroup="ht32f490x1_conf" Cversion="1.0.0" condition="HT32F490x1 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/ht32f490x1_conf.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup HT32F490x1  -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="HT32F490x1">
      <description>System Startup for Holtek HT32F490x1  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/ht32f490x1.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_ht32f490x1.s" attr="config" version="1.0.0" condition="HT32F490x1 ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_ht32f490x1.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
